app/controllers/application_controller.rb

  def current_user
      if session[:usuario_id]
          @current_user ||= Usuario.find(session[:usuario_id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]