app/controllers/enderecos_controller.rb

SELECT "enderecos".* FROM "enderecos"
---
  def index
    @enderecos = Endereco.all

INSERT INTO "enderecos" ("cep", "cidade", "bairro", "logradouro", "complemento", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @endereco = Endereco.new(endereco_params)

    respond_to do |format|
      if @endereco.save

DELETE FROM "enderecos" WHERE "enderecos"."id" = ?  [["id", 1]]
---
  def destroy
    @endereco.destroy

SELECT "enderecos".* FROM "enderecos" WHERE "enderecos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_endereco
      @endereco = Endereco.find(params[:id])