app/controllers/sessions_controller.rb

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."cpf" = ? LIMIT ?  [["cpf", 12345678999], ["LIMIT", 1]]
---
  def create
    usuario = Usuario.find_by_cpf(params[:cpf])