app/controllers/usuarios_controller.rb

  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("nome", "data_nascimento", "cpf", "senha", "nome_mae", "telefone", "email", "endereco_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @usuario.update(usuario_params)
---
UPDATE "usuarios" SET "telefone" = ?, "updated_at" = ? WHERE "usuarios"."id" = ?  [["telefone", 999999998], ["updated_at", "2021-05-16 21:31:46.836095"], ["id", 1]]

    def set_enderecos
      @enderecos = Endereco.all.map{ |c| [c.logradouro, c.id]}
---
SELECT "enderecos".* FROM "enderecos"