app/controllers/vacinacaos_controller.rb

SELECT "vacinacaos".* FROM "vacinacaos"
---
  def index
    @vacinacaos = Vacinacao.all

INSERT INTO "vacinacaos" ("nome_vacina", "descricao_localizacao", "data", "horario", "usuario_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @vacinacao = Vacinacao.new(vacinacao_params)
    @vacinacao.write_attribute(:usuario_id, @current_user.id)

    respond_to do |format|
      if @vacinacao.save

UPDATE "vacinacaos" SET "horario" = ?, "updated_at" = ? WHERE "vacinacaos"."id" = ?  [["horario", "2000-01-01 05:14:00"], ["updated_at", "2021-05-22 05:16:41.646183"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @vacinacao.update(vacinacao_params)

SELECT "vacinacaos".* FROM "vacinacaos" WHERE "vacinacaos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_vacinacao
      @vacinacao = Vacinacao.find(params[:id])